kAMDSuccess = "There was no error.";
kAMDUndefinedError = "An unknown error occurred.";
kAMDBadHeaderError = "Could not transfer file.";
kAMDNoResourcesError = "Could not allocate a resource.";
kAMDReadError = "Could not read from the device.";
kAMDWriteError = "Could not write to the device.";
kAMDUnknownPacketError = "The packet is unknown.";
kAMDInvalidArgumentError = "The argument is invalid.";
kAMDNotFoundError = "The file could not be found.";
kAMDIsDirectoryError = "The path is a directory.";
kAMDPermissionError = "You do not have permission.";
kAMDNotConnectedError = "Not connected to the device.";
kAMDTimeOutError = "The operation timed out.";
kAMDOverrunError = "There was a buffer overrun.";
kAMDEOFError = "End of file.";
kAMDUnsupportedError = "This operation is unsupported.";
kAMDFileExistsError = "The file already exists.";
kAMDBusyError = "The device is busy.";
kAMDCryptoError = "Could not establish a secure connection to the device.";
kAMDTooBigError = "The message is too big.";
kAMDInvalidResponseError = "Received an unexpected response from the device.";
kAMDMissingKeyError = "The key is missing.";
kAMDMissingValueError = "The value is missing.";
kAMDGetProhibitedError = "Cannot retrieve value from the passcode locked device.";
kAMDSetProhibitedError = "Cannot set value on device.";
kAMDRemoveProhibitedError = "Cannot remove value on device.";
kAMDImmutableValueError = "This value cannot be changed.";
kAMDPasswordProtectedError = "The device is passcode protected.";
kAMDMissingHostIDError = "The device does not recognize this host.";
kAMDInvalidHostIDError = "The device does not recognize this host.";
kAMDSessionActiveError = "The session is active.";
kAMDSessionInactiveError = "The session is inactive.";
kAMDMissingSessionIDError = "The session ID is missing.";
kAMDInvalidSessionIDError = "The session ID is invalid.";
kAMDMissingServiceError = "The service is missing.";
kAMDInvalidServiceError = "The service is invalid.";
kAMDServiceLimitError = "Too many instances of this service are already running.";
kAMDCheckinSetupFailedError = "Could not start service on device";
kAMDInvalidCheckinError = "Could not start service on device";
kAMDCheckinTimeoutError = "The service did not start properly on the device.";
kAMDCheckinConnectionFailedError = "The service did not start properly on the device.";
kAMDCheckinReceiveFailedError = "The service did not start properly on the device.";
kAMDCheckinResponseFailedError = "The service did not start properly on the device.";
kAMDCheckinOutOfMemoryError = "The service did not start properly on the device.";
kAMDCheckinSendFailedError = "The service did not start properly on the device.";
kAMDMissingPairRecordError = "The host is not paired with the device.";
kAMDInvalidPairRecordError = "The host is no longer paired with the device.";
kAMDSavePairRecordFailedError = "Could not save the pairing record.";
kAMDInvalidActivationRecordError = "The activation record is not valid.";
kAMDMissingActivationRecordError = "The activation record could not be found.";
kAMDServiceProhibitedError = "The service could not be started on the device.";
kAMDEscrowLockedError = "Device is not available until first unlock after boot.";
kAMDProhibitedBySupervision = "Operation prohibited on supervised devices.";
kAMDPairingProhibitedError = "Pairing only allowed over USB.";
kAMDWrongDroidError = "The device is in recovery mode.";
kAMDSUVerificationError = "The software update package could not be verified.";
kAMDSUPatchError = "Could not patch the file.";
kAMDSUFirmwareError = "Could not flash the firmware.";
kAMDProvisioningProfileNotValid = "The provisioning profile is not valid.";
kAMDSendMessageError = "Could not send a message to the device.";
kAMDReceiveMessageError = "Could not receive a message from the device.";
kAMDMissingOptionsError = "The options are missing.";
kAMDMissingImageTypeError = "The image is missing.";
kAMDDigestFailedError = "Could not read disk image.";
kAMDStartServiceError = "The service could not be started.";
kAMDInvalidDiskImageError = "The disk image is invalid.";
kAMDMissingDigestError = "The digest is missing.";
kAMDMuxError = "There was an error with the USB device multiplexor.";
kAMDApplicationAlreadyInstalledError = "A system application with the given bundle identifier is already installed on the device and cannot be replaced.";
kAMDApplicationMoveFailedError = "The application could not be moved into place on the device.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "The application could not be sandboxed.";
kAMDApplicationVerificationFailedError = "The application could not be verified.";
kAMDArchiveDestructionFailedError = "Could not remove the application archive.";
kAMDBundleVerificationFailedError = "The carrier bundle could not be verified.";
kAMDCarrierBundleCopyFailedError = "Could not install the carrier bundle.";
kAMDCarrierBundleDirectoryCreationFailedError = "Could not create the carrier bundle directory.";
kAMDCarrierBundleMissingSupportedSIMsError = "There are no supported SIMs for this carrier bundle.";
kAMDCommCenterNotificationFailedError = "Could not listen for notification from the baseband.";
kAMDContainerCreationFailedError = "Could not create application container.";
kAMDContainerP0wnFailedError = "Could not repair permissions on application container.";
kAMDContainerRemovalFailedError = "Could not remove the application container.";
kAMDEmbeddedProfileInstallFailedError = "Could not install the embedded provisioning profile.";
kAMDErrorError = "An error occurred.";
kAMDExecutableTwiddleFailedError = "Could not change executable permissions on the application.";
kAMDExistenceCheckFailedError = "Could not check to see if the application already exists.";
kAMDInstallMapUpdateFailedError = "Could not update the installed applications list.";
kAMDManifestCaptureFailedError = "Could not save the application manifest.";
kAMDMapGenerationFailedError = "Could not generate the map.";
kAMDMissingBundleExecutableError = "The application bundle does not contain an executable.";
kAMDMissingBundleIdentifierError = "The application bundle does not contain a valid identifier.";
kAMDMissingBundlePathError = "Could not determine the application bundle path.";
kAMDMissingContainerError = "Could not find the container for the installed application.";
kAMDNotificationFailedError = "Could not post a notification.";
kAMDPackageExtractionFailedError = "Could not open the application package.";
kAMDPackageInspectionFailedError = "Could not inspect the application package.";
kAMDPackageMoveFailedError = "Could not move the application package into the staging location.";
kAMDPathConversionFailedError = "Could not convert the path.";
kAMDRestoreContainerFailedError = "Could not restore the application container.";
kAMDSeatbeltProfileRemovalFailedError = "Could not remove the application seatbelt profile.";
kAMDStageCreationFailedError = "Could not create the staging directory.";
kAMDSymlinkFailedError = "Could not create the symlink.";
kAMDiTunesArtworkCaptureFailedError = "Could not save the iTunes artwork.";
kAMDiTunesMetadataCaptureFailedError = "Could not save the iTunes metadata.";
kAMDAlreadyArchivedError = "The application is already archived.";
kAMDUnknownCommandError = "The device does not recognize the command.";
kAMDAPIInternalError = "There was an internal API error.";
kAMDMuxCreateListenerError = "Could not listen for USB devices.";
kAMDMuxGetListenerError = "Could not get the USB listener.";
kAMDMuxConnectError = "Could not connect to the device.";
kAMDDeviceTooNewError = "This application needs to be updated.";
kAMDDeviceRefNoGood = "This device is no longer connected.";
kAMDDeviceDisconnectedError = "This device is no longer connected.";
kAMDCannotTranslateError = "Could not translate messages from device";
kAMDMobileImageMounterMissingImageSignature = "Could not support development.";
kAMDMobileImageMounterResponseCreationFailed = "Could not support development.";
kAMDMobileImageMounterMissingImageType = "Could not support development.";
kAMDMobileImageMounterMissingImagePath = "Could not support development.";
kAMDMobileImageMounterImageMapLoadFailed = "Could not support development.";
kAMDMobileImageMounterAlreadyMounted = "Could not support development.";
kAMDMobileImageMounterImageMoveFailed = "Could not support development.";
kAMDMobileImageMounterMountPathMissing = "Could not support development.";
kAMDMobileImageMounterMountPathNotEmpty = "Could not support development.";
kAMDMobileImageMounterImageMountFailed = "Could not support development.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Could not support development.";
kAMDMobileImageMounterDigestFailed = "Could not support development.";
kAMDMobileImageMounterDigestCreationFailed = "Could not support development.";
kAMDMobileImageMounterImageVerificationFailed = "Could not support development.";
kAMDMobileImageMounterImageInfoCreationFailed = "Could not support development.";
kAMDMobileImageMounterImageMapStoreFailed = "Could not support development.";
kAMDDeviceOSVersionTooLow = "The device OS version is too low.";
kAMDNoWifiSyncSupportError = "Device doesn't support wireless sync.";
kAMDDeviceFamilyNotSupported = "This application does not support this kind of device.";
kAMDPackagePatchFailedError = "Could not apply patch update to application.";
kAMDIncorrectArchitectureError = "This application does support this device's CPU type.";
kAMDPluginCopyFailedError = "Could not copy VPN Plugin into app container.";
kAMDBreadcrumbFailedError = "Could not write installation breadcrumb.";
kAMDBreadcrumbUnlockError = "Could not update installation breadcrumb.";
kAMDGeoJSONCaptureFailedError = "Could not save the GeoJSON data.";
kAMDNewsstandArtworkCaptureFailedError = "Could not save the Newsstand artwork.";
kAMDMissingCommandError = "The request did not contain a command.";
kAMDNotEntitledError = "The requesting application is not allowed to make this request.";
kAMDMissingPackagePathError = "Request was missing the package path.";
kAMDMissingContainerPathError = "Request was missing the container path.";
kAMDMissingApplicationIdentifierError = "Request was missing the application identifier.";
kAMDMissingAttributeValueError = "Request was missing a required value.";
kAMDLookupFailedError = "Could not list installed applications.";
kAMDDictCreationFailedError = "Could not extract capabilities from the request.";

/* kMISFileError */
"A file operation failed." = "A file operation failed.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "A signed resource has been added, modified, or deleted.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "A valid provisioning profile for this executable was not found.";

/* kMISUnknownError */
"An unknown error has occurred." = "An unknown error has occurred.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Attempted to modify an immutable provisioning profile.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "The application does not have a valid signature.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "The application's signature is valid but it does not match the expected hash.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "The executable contains an invalid signature.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "The executable was signed with invalid entitlements.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "The identity used to sign the executable is no longer valid.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "The signature was not valid.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "There was an error communicating with your device.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "This provisioning profile cannot be installed on this device.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature).";

/* kMISExpiredError */
"This provisioning profile has expired." = "This provisioning profile has expired.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "This provisioning profile is malformed.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "This provisioning profile is unsupported.";

/* kMISAllocationError */
"Unable to allocate memory." = "Unable to allocate memory.";

